Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/cancer_services/cervical_screening_programme.html.txt.tmx
Source language: en
Languages: ga

source: CervicalCheck: The National Cervical Screening Programme
ga: CervicalCheck: An Clár Scagthástála Ceirbheacs Náisiúnta

source: CervicalCheck is a national screening programme to prevent and control cervical cancer
ga: Clár náisiúnta scagthástála is ea CervicalCheck chun cosc a chur ar ailse cheirbheacsach agus í a rialú

source: The programme provides smear tests to women between the ages of 25 and 60
ga: Soláthraíonn an clár tástálacha smeartha do mhná idir aois 25 agus 60 bliain

source: A smear test is a simple procedure that only takes minutes and is the most effective way to detect changes in the cells of the cervix
ga: Gnáthamh simplí is ea tástáil smeartha nach nglacann ach cúpla nóiméad agus is é an bealach is éifeachtaí chun athruithe atá tagtha ar chillíní an cheirbheacs a bhrath

source: The programme is voluntary and you are free to choose not to take part
ga: Clár deonach is ea é, is fútsa atá sé a roghnú gan páirt a ghlacadh ann

source: If you have any concerns regarding cervical cancer, have a family history of cervical cancer or have symptoms you are worried about, you should contact your family doctor (GP)
ga: Má tá aon bhuarthaí ort maidir le hailse cheirbheacsach, má tá stair d’ailse cheirbheacsach i do mhuintir nó má tá comharthaí agat a bhfuil tú buartha fúthu, ba cheart duit teagmháil a dhéanamh le do dhochtúir teaghlaigh (DG)

source: CervicalCheck provides free smear tests to women aged 25 to 60 who are resident in the Republic of Ireland
ga: Soláthraíonn CervicalCheck tástálacha smeartha saor in aisce do mhná idir aois 25 agus 60 bliain a bhfuil cónaí orthu i bPoblacht na hÉireann

source: Women outside of the eligibility guidelines
ga: Mná lasmuigh de na treoirlínte incháilitheachta

source: Although CervicalCheck normally provides free smear tests only to women aged 25 to 60, there are a number of exceptions to the screening age including women who:
ga: Cé gur gnách nach soláthraíonn CervicalCheck tástálacha smeartha saor in aisce ach do mhná idir aois 25 agus 60 bliain, tá roinnt eisceachtaí ann i leith na haoise scagthástála, ina measc:

source: • Are over 60 years of age and have never had a smear test
ga: • Mná atá os cionn aois 60 bliain nár thug faoi thástáil smeartha riamh

source: • Have attended a colposcopy service and require follow-up
ga: • Mná a d’fhreastail ar sheirbhís ionscópachta ar an drólann agus a dteastaíonn coinne leantach uathu

source: • Have had or are about to have an organ transplant
ga: • Mná a ndearnadh trasphlandú orgáin orthu nó atá ar tí tabhairt faoi thrasphlandú orgáin

source: • Are on renal dialysis
ga: • Mná a bhfuil scagdhealú duánach á dhéanamh orthu

source: If you are aged between 25 and 60 and have never had a CervicalCheck smear test you can simply make an appointment with a registered GP practice or clinic
ga: Má tá tú idir 25 agus 60 bliain d’aois agus murar tugadh faoi thástáil smeartha CervicalCheck ort riamh roimhe seo, ní gá duit ach coinne a dhéanamh le cleachtas nó clinic cláraithe DG

source: A letter of invitation is not needed to make an appointment and attend for a first CervicalCheck smear test
ga: Ní theastaíonn litir chuiridh chun coinne a dhéanamh agus chun freastal ar do chéad tástáil smeartha CervicalCheck

source: To arrange a smear test you can contact a registered smeartaker of your choice to make an appointment
ga: Chun tástáil smeartha a shocrú, féadfaidh tú teagmháil a dhéanamh le do rogha glacadóir smeartha chun coinne a dhéanamh

source: Thousands of GPs, practice nurses, and women's health, family planning and Well Woman clinics all over Ireland are registered and you can see a full list in the Find a Smeartaker section of CervicalCheck or by calling CervicalCheck on Freephone 1800 45 45 55
ga: Tá na mílte DG, altra cleachtais, clinic sláinte ban, pleanála clainne agus clinic Well Woman ar fud na hÉireann go léir cláraithe agus féadfaidh tú teacht ar liosta iomlán díobh sa mhír Aimsigh Glacadóir Smeartha de chuid CervicalCheck nó trí ghlao ar CervicalCheck ar Shaorghlao 1800 45 45 55

source: CervicalCheck also sends invitation letters to women who are on the CervicalCheck register
ga: Anuas air sin, seolann CervicalCheck litreacha cuiridh do mhná atá ar chlár CervicalCheck

source: You can check online whether you are on the register or call CervicalCheck on Freephone 1800 45 45 55
ga: Féadfaidh tú seiceáil ar líne an bhfuil tú ar an gclár nó glao ar CervicalCheck ar Shaorghlao 1800 45 45 55

source: To register by post, download the self-registration form (pdf)
ga: Chun clárú sa phost, íoslódáil an fhoirm féinchláraithe (pdf)

source: Women who have already had a CervicalCheck smear test will be automatically re-called by letter when their next smear test is due
ga: Déanfar mná ar tugadh faoi thástáil smeartha CervicalCheck orthu cheana féin a athghairm go huathoibríoch trí litir a sheoladh chucu ina luaitear cathain a bheidh a gcéad tástáil smeartha eile le déanamh

source: CervicalCheck has produced a number of information leaflets which provide simple information on cervical screening and what to expect when you go for your smear test
ga: Sholáthair CervicalCheck roinnt bileoga faisnéise a sholáthraíonn faisnéis neamhchasta ar scagthástáil cheirbheacsach agus ar an méid ar cheart duit coinne a bheith agat leis nuair a thugann tú faoi do thástáil smeartha

source: In addition, they have a list of frequently asked questions, which will help answer many of the common questions regarding cervical screening
ga: Anuas air sin, tá liosta acu de cheisteanna coitianta, a chabhróidh leat go leor de na ceisteanna coitianta a bhaineann le scagthástáil cheirbheacsach a fhreagairt

source: The National Cervical Screening Programme
ga: Urlár Uachtarach Sciathán Thiar ó Dheas

source: Locall:1800 45 45 55
ga: Lóghlao:1800 45 45 55

source: The Irish Cancer Society has information booklets on a number of topics, including Cervical Smear Test Results (pdf)
ga: Tá leabhráin eolais ag Cumann Ailse na hÉireann maidir le roinnt ábhair, agus Torthaí na Scagthástála Ceirbheacs (pdf) san áireamh
